In [1]:
import pandas as pd

### Reindexing

In [2]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
obj.dtype

dtype('float64')

In [4]:
# Using reindex method
# Place NaN if no value is found
obj1 = obj.reindex(['a','b','c','d','e'])
obj1

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [5]:
obj2 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
obj2

0      blue
2    purple
4    yellow
dtype: object

In [6]:
obj2.reindex(range(6), method ='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [7]:
import numpy as np

In [8]:
frame = pd.DataFrame(np.arange(9).reshape(3,3), index=['a','c','d'], columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [9]:
frame2 = frame.reindex(['a','b','c','d'])

In [10]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [11]:
frame2.columns

Index(['Ohio', 'Texas', 'California'], dtype='object')

In [12]:
frame2.columns = ['California', 'Texas', 'Ohio']

In [13]:
frame2

   California  Texas  Ohio
a         0.0    1.0   2.0
b         NaN    NaN   NaN
c         3.0    4.0   5.0
d         6.0    7.0   8.0

In [14]:
frame2.columns = ['Ohio','Texas','California'] 
# Only labels are replaced, values remain same

In [15]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [16]:
frame2.reindex(columns=['California','Texas','Utah'])
# Whole column is replaced

   California  Texas  Utah
a         2.0    1.0   NaN
b         NaN    NaN   NaN
c         5.0    4.0   NaN
d         8.0    7.0   NaN

In [17]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [18]:
frame.loc[['c','d','a'],['California','Ohio','Texas']]

   California  Ohio  Texas
c           5     3      4
d           8     6      7
a           2     0      1

### Dropping Entries from an Axis

In [19]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [20]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [21]:
obj.drop(['c','d'])

a    0.0
b    1.0
e    4.0
dtype: float64

#### With DataFrame, index values can be deleted from either axis.

In [22]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    columns=['one', 'two', 'three', 'four'],
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],)
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [23]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

### Dropping values from coloumns (axis = 1)

In [24]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [25]:
data.drop('two',axis='columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

#### Manipulating an Object's Inplace

In [26]:
obj.drop('c',inplace = True)

In [27]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64